#--------------------------------------------------------------------------------
# 참조 모듈 목록.
#--------------------------------------------------------------------------------
from __future__ import annotations
from typing import Any, Final, Optional, Type, TypeVar, Union
import builtins
import os
from pyappcore.application import Application
from pyappcore.str_util import GetSplitFilePath


#--------------------------------------------------------------------------------
# 전역 상수 목록.
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# 프로세스 정보.
#--------------------------------------------------------------------------------
class ProcessInfo:
	pass